Repository: magi1125/inclusive-design-pattern
Catalog: tm/chapter-14_EN-US_JA.tmx
Source language: en_us
Languages: ja

source: The toggle button example does not use Shadow DOM, so could still associate itself with an element of ID #toggleTarget using aria-controls="toggleTarget".
ja: トグルボタンの例はShadow DOMを使っていないので、aria-controls="toggleTarget"を使ってIDが#toggleTargetの要素と関連付けることができます。

source: Nonetheless, if it did employ Shadow DOM, this would become impossible.
ja: とは言え、Shadow DOMを使用した場合は、それは不可能になります。

source: As for tabindex, using a positive integer like tabindex="4" will refer to the fourth in focus order within the shadow DOM and not the fourth in focus order within the parent document.
ja: tabindexに関しては、tabindex="4"などの正の整数を使用すると、Shadow DOM内のフォーカス順序の4番目を参照し、親ドキュメント内のフォーカス順序の4番目は参照しません。

source: This may have some useful applications, but use of explicit tabindex ordering is not advised in any case.
ja: これは便利な点もあるかもしれませんが、明確なtabindex順序の使用はどのような場合にもお勧めできません。

source: Focus order should follow source order for logical keyboard operation.
ja: 理にかなったキーボード操作のためには、フォーカス順序はソースの順序に従うべきです。

source: This is most easily achieved simply by using implicitly focusable elements and — where necessary — elements with tabindex="0".
ja: これを最も簡単に実行するには、暗黙的にフォーカス可能な要素、および必要に応じてtabindex="0"を指定した要素を使います。

source: Both of which are placed in default focus order according to source order, unaffected by Shadow DOM subtrees.
ja: どちらもソースの順序に従って、デフォルトのフォーカス順序で配置されていて、Shadow DOMのサブツリーの影響を受けません。

source: 1.https://www.w3.org/TR/WCAG20/#text-equiv 2.https://www.w3.org/TR/WCAG20/#keyboard-operation 3.https://www.w3.org/TR/WCAG20/#ensure-compat 4.https://www.joedolson.com/2016/01/im-an-accessibility-consultant-stop-hiring-me/ 5.https://github.com/w3c/webcomponents 6.https://w3c.github.io/webcomponents/spec/custom/ 7.https://w3c.github.io/webcomponents/spec/shadow/ 8.https://github.com/shawnbot/custom-elements 9.https://developer.mozilla.org/en/docs/Web/API/HTMLButtonElement 10.https://developer.mozilla.org/en-US/docs/Web/API/HTMLElement 11.http://www.html5rocks.com/en/tutorials/webcomponents/customelements/#lifecycle 12.http://codepen.io/heydon/pen/ZOqwqQ 13.https://www.w3.org/TR/wai-aria/states_and_properties#attrs_relationships_header 14.https://www.paciellogroup.com/blog/2014/03/stuff-doesnt-work-dom-shadow-dom/
ja: 71 https://www.w3.org/TR/WCAG20/#text-equiv 72 https://www.w3.org/TR/WCAG20/#keyboard-operation 73 https://www.w3.org/TR/WCAG20/#ensure-compat 74 http://smashed.by/stop-hiring-me 75 https://github.com/w3c/webcomponents 76 https://w3c.github.io/webcomponents/spec/custom/ 77 https://w3c.github.io/webcomponents/spec/shadow/ 78 https://github.com/shawnbot/custom-elements 79 http://smashed.by/htmlbtn 80 http://smashed.by/stop-hiring-me 81 http://smashed.by/lifecycle 82 http://codepen.io/heydon/pen/ZOqwqQ 83 http://smashed.by/ariarel 84 http://smashed.by/shadowdom
